_test-results/2/webmvc-jdbc-tomcat-16-ramping-arrival-rate-stress-2-max-vus-1000.txt
k6 run script-ramping-arrival-rate-stress-2.js -o experimental-prometheus-rw -o csv=webmvc-jdbc-tomcat-16-ramping-arrival-rate-stress-2-max-vus-1000-real.gz --tag profile=webmvc-jdbc-tomcat-ramping-arrival-rate-stress-2-max-vus-1000-real --tag threads=16

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: script-ramping-arrival-rate-stress-2.js
     output: Prometheus remote write (https://prometheus.catbro.keenetic.pro/api/v1/write), csv (webmvc-jdbc-tomcat-16-ramping-arrival-rate-stress-2-max-vus-1000-real.gz)

  scenarios: (100.00%) 1 scenario, 1000 max VUs, 14m30s max duration (incl. graceful stop):
           * petclinic: Up to 800.00 iterations/s for 14m0s over 34 stages (maxVUs: 10-1000, gracefulStop: 30s)

WARN[0188] Insufficient VUs, reached 1000 active VUs and cannot initialize more  executor=ramping-arrival-rate scenario=petclinic

     ✓ post owner status was 201
     ✓ post pet status was 201
     ✓ post visit status was 201
     ✓ get owner status was 200
     ✓ get pet status was 200
     ✓ get visit status was 200
     ✓ find owners status was 200
     ✓ put pet status was 200
     ✓ put visit status was 200
     ✓ put owner status was 200

     checks.........................: 100.00% ✓ 2721340     ✗ 0      
     data_received..................: 875 MB  1.0 MB/s
     data_sent......................: 430 MB  512 kB/s
     dropped_iterations.............: 184966  220.182017/s
     http_req_blocked...............: avg=6.45µs   min=176ns   med=398ns    max=247.98ms p(90)=501ns    p(95)=544ns   
     http_req_connecting............: avg=1.25µs   min=0s      med=0s       max=68.59ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=242.66ms min=2.62ms  med=271.92ms max=839.35ms p(90)=293.02ms p(95)=302.66ms
       { expected_response:true }...: avg=242.66ms min=2.62ms  med=271.92ms max=839.35ms p(90)=293.02ms p(95)=302.66ms
     http_req_failed................: 0.00%   ✓ 0           ✗ 2721340
     http_req_receiving.............: avg=542.4µs  min=15.34µs med=62.93µs  max=554.42ms p(90)=562.92µs p(95)=3.04ms  
     http_req_sending...............: avg=78.31µs  min=15.21µs med=46.75µs  max=548.18ms p(90)=78.34µs  p(95)=119.59µs
     http_req_tls_handshaking.......: avg=4.58µs   min=0s      med=0s       max=243.2ms  p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=242.04ms min=2.54ms  med=271.63ms max=835.61ms p(90)=292.07ms p(95)=300.33ms
     http_reqs......................: 2721340 3239.460922/s
     iteration_duration.............: avg=2.42s    min=41.36ms med=2.74s    max=3.61s    p(90)=2.83s    p(95)=2.86s   
     iterations.....................: 272134  323.946092/s
     vus............................: 0       min=0         max=1000 
     vus_max........................: 1000    min=10        max=1000 


running (14m00.1s), 0000/1000 VUs, 272134 complete and 0 interrupted iterations
petclinic ✓ [======================================] 0000/1000 VUs  14m0s  004.47 iters/s