_test-results/2/webmvc-jdbc-tomcat-16-ramping-arrival-rate-stress-2-max-vus-200.txt
 k6 run script-ramping-arrival-rate-stress-2.js -o experimental-prometheus-rw -o csv=webmvc-jdbc-tomcat-16-ramping-arrival-rate-stress-2-max-vus-200.gz --tag profile=webmvc-jdbc-tomcat-ramping-arrival-rate-stress-2-max-vus-200 --tag threads=16

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: script-ramping-arrival-rate-stress-2.js
     output: Prometheus remote write (https://prometheus.catbro.keenetic.pro/api/v1/write), csv (webmvc-jdbc-tomcat-16-ramping-arrival-rate-stress-2-max-vus-200.gz)

  scenarios: (100.00%) 1 scenario, 200 max VUs, 14m30s max duration (incl. graceful stop):
           * petclinic: Up to 800.00 iterations/s for 14m0s over 34 stages (maxVUs: 10-200, gracefulStop: 30s

WARN[0147] Insufficient VUs, reached 200 active VUs and cannot initialize more  executor=ramping-arrival-rate scenario=petclinic
WARN[0765] Request Failed                                error="Put \"https://springpetclinicrest.ru/api/pets/360336\": read tcp 10.166.0.54:48888->34.110.223.40:443: read: connection reset by peer"
WARN[0765] Request Failed                                error="Get \"https://springpetclinicrest.ru/api/pets/360392\": read tcp 10.166.0.54:39868->34.110.223.40:443: read: connection reset by peer"
WARN[0765] Request Failed                                error="Put \"https://springpetclinicrest.ru/api/pets/360325\": read tcp 10.166.0.54:60888->34.110.223.40:443: read: connection reset by peer"

     ✓ post owner status was 201
     ✓ post pet status was 201
     ✓ post visit status was 201
     ✓ get owner status was 200
     ✗ get pet status was 200
      ↳  99% — ✓ 259140 / ✗ 1
     ✓ get visit status was 200
     ✓ find owners status was 200
     ✗ put pet status was 200
      ↳  99% — ✓ 259139 / ✗ 2
     ✓ put visit status was 200
     ✓ put owner status was 200

     checks.........................: 99.99%  ✓ 2591407    ✗ 3
     data_received..................: 832 MB  991 kB/s
     data_sent......................: 410 MB  488 kB/s
     dropped_iterations.............: 197959  235.651066/s
     http_req_blocked...............: avg=1.17µs   min=171ns    med=408ns    max=46.87ms p(90)=517ns    p(95)=557ns
     http_req_connecting............: avg=43ns     min=0s       med=0s       max=4.41ms  p(90)=0s       p(95)=0s
     http_req_duration..............: avg=53.36ms  min=338.49µs med=54.45ms  max=1.03s   p(90)=115.94ms p(95)=163.2ms
       { expected_response:true }...: avg=53.36ms  min=2.75ms   med=54.45ms  max=1.03s   p(90)=115.94ms p(95)=163.2ms
     http_req_failed................: 0.00%   ✓ 3          ✗ 2591407
     http_req_receiving.............: avg=133.68µs min=0s       med=50.23µs  max=58.79ms p(90)=179.96µs p(95)=329.25µs
     http_req_sending...............: avg=49.12µs  min=14.4µs   med=41.04µs  max=31.67ms p(90)=62.75µs  p(95)=76.26µs
     http_req_tls_handshaking.......: avg=613ns    min=0s       med=0s       max=13.26ms p(90)=0s       p(95)=0s
     http_req_waiting...............: avg=53.18ms  min=297.7µs  med=54.31ms  max=1.03s   p(90)=115.76ms p(95)=163.03ms
     http_reqs......................: 2591410 3084.82326/s
     iteration_duration.............: avg=535.3ms  min=40.99ms  med=537.55ms max=2.2s    p(90)=807.76ms p(95)=893.82ms
     iterations.....................: 259141  308.482326/s
     vus............................: 0       min=0        max=200
     vus_max........................: 200     min=10       max=200


running (14m00.1s), 000/200 VUs, 259141 complete and 0 interrupted iterations
petclinic ✓ [======================================] 000/200 VUs  14m0s  004.47 iters/s